{
  "education": [
    {
      "awards_achievements": [
        "GPA: 3.3/4.0"
      ],
      "degree": "Bachelor in Software Engineering Technology",
      "department": "Computer and Software Engineering",
      "duration": "2019-2021",
      "school_name": "McMaster University"
    },
    {
      "awards_achievements": null,
      "degree": "Advance Diploma in Electronics Engineering Technology",
      "department": "Electrical and Computer Engineering",
      "duration": "2010-2014",
      "school_name": "Conestoga College"
    }
  ],
  "github_repo_root_url": "https://github.com/jarviscanada/jarvis_data_eng_HassanAkbar",
  "highlighted_projects": [
    {
      "description": "Connecting \u0026 shaping data, creating table relationships \u0026 data models in Power BI, analyzing data with DAX calculations and visualizing data with Power BI reports.",
      "name": "BI Reporting"
    },
    {
      "description": "Extracted world bank data set from different sources, transformed data by combining data from different sources, cleaning data sets and bring them together into one table and loaded the results into the database.",
      "git_url": null,
      "name": "ETL Pipelines"
    }
  ],
  "jarvis_projects": [
    {
      "description": "Implemented a Cluster Monitoring Solution using Bash to collect the hardware specifications of each node and monitor node resource usages. The data will be collected and stored on a PostgreSQL server that runs inside a docker container.",
      "git_url": "https://github.com/jarviscanada/jarvis_data_eng_HassanAkbar/tree/master/linux_sql",
      "name": "Linux Cluster Monitor"
    },
    {
      "description": [
        "JDBC App: Implemented a Java Database Connectivity app that manages connecting to a database. Application allow user to perform CRUD operation by using SQL queries and commands, and handling result sets obtained from the database. The application was implemented by using PostgresSQL, Maven, Docker and Java.",
        "Grep App: Grep Application was designed to perform exactly same as Linux grep command. Application searches files in the directory, and regex pattern matching with strings within the files and output the results into separate file. The application was packaged using Maven and saved to Docker Hub as a Docker Image where it can be pulled and run."
      ],
      "git_url": "https://github.com/jarviscanada/jarvis_data_eng_HassanAkbar/tree/master/core_java",
      "name": "Core Java Apps"
    }
  ],
  "name": "Hassan Akbar",
  "others": [
    {
      "bullets": [
        "Business Management (2021)"
      ],
      "title": "Certificates"
    },
    {
      "bullets": [
        "Vollyball player",
        "Fixing electronics devices",
        "Business Updates"
      ],
      "title": "Activities/Hobbies"
    }
  ],
  "professional_experience": [
    {
      "company": "National Bank of Canada",
      "description": "Developing automated functional tests using nbc frameworks embedded in continuous testing (CT) in Agile mode. Monitoring QA activities daily including developing and executing tests, managing irregularities, and providing progress report. ",
      "duration": "2022-present",
      "title": "QA Automation/Manual"
    },
    {
      "company": "Jarvis",
      "description": "Working difficult programming challenges to solve with minimal initial directions. We are grouped into agile teams and have been assigned Jarvis scrum masters, product owners, and teach leads to agile teams to facilitate developers. We manage our projects using Git, Github, and GitFlow. ",
      "duration": "2021-present",
      "title": "Junior Developer"
    },
    {
      "company": "Rideon Canada",
      "description": "Leading activities related to initial data testing phase 1 of RideON app, and monitoring the marketing campaign for the app launch. Planning and maintaining project timelines, deliverables, expenses, and team activities. ",
      "duration": "2021-2022",
      "title": "Project Coordinator"
    }
  ],
  "skills": {
    "competent": [
      "Google Cloud Platform",
      "HTML",
      "CSS",
      "Power BI",
      "Excel",
      "Datadog",
      "Terraform",
      "Jenkins",
      "Postman",
      "AWS"
    ],
    "familiar": [
      "C",
      "C++",
      "Hadoop",
      "Javascript",
      "Spark/Scala",
      "SAS",
      "SoapUI"
    ],
    "proficient": [
      "Java",
      "Linux/Bash",
      "RDBMS/SQL",
      "Agile/Scrum",
      "Git",
      "REST APIs",
      "Selenium",
      "Manual/Automation testing",
      "Regression/smoke testing",
      "Python",
      "Jira/Confluence"
    ]
  },
  "summary": "Software engineer graduate from McMaster University with fundamental knowledge of software architecture, software requirement and specification, data analysis, data mining, data warehousing and data visualization. Seeking to utilize broad educational background with excellent analytical, technical, and programming skills within your workplace."
}
